grevaillot/svd_tools/headers/STM32H7x7_CM7/dmamux1.h
#pragma once 

/* --- DMAMUX1: DMAMUX ---------------------------------------------- */

/** @defgroup dmamux1_registers DMAMUX Register
@{*/

/** DMAMUX1_DMAMUX1_C0CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C0CR			MMIO32(DMAMUX1_BASE + 0x00)
/** DMAMUX1_DMAMUX1_C1CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C1CR			MMIO32(DMAMUX1_BASE + 0x04)
/** DMAMUX1_DMAMUX1_C2CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C2CR			MMIO32(DMAMUX1_BASE + 0x08)
/** DMAMUX1_DMAMUX1_C3CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C3CR			MMIO32(DMAMUX1_BASE + 0x0c)
/** DMAMUX1_DMAMUX1_C4CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C4CR			MMIO32(DMAMUX1_BASE + 0x10)
/** DMAMUX1_DMAMUX1_C5CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C5CR			MMIO32(DMAMUX1_BASE + 0x14)
/** DMAMUX1_DMAMUX1_C6CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C6CR			MMIO32(DMAMUX1_BASE + 0x18)
/** DMAMUX1_DMAMUX1_C7CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C7CR			MMIO32(DMAMUX1_BASE + 0x1c)
/** DMAMUX1_DMAMUX1_C8CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C8CR			MMIO32(DMAMUX1_BASE + 0x20)
/** DMAMUX1_DMAMUX1_C9CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C9CR			MMIO32(DMAMUX1_BASE + 0x24)
/** DMAMUX1_DMAMUX1_C10CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C10CR			MMIO32(DMAMUX1_BASE + 0x28)
/** DMAMUX1_DMAMUX1_C11CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C11CR			MMIO32(DMAMUX1_BASE + 0x2c)
/** DMAMUX1_DMAMUX1_C12CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C12CR			MMIO32(DMAMUX1_BASE + 0x30)
/** DMAMUX1_DMAMUX1_C13CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C13CR			MMIO32(DMAMUX1_BASE + 0x34)
/** DMAMUX1_DMAMUX1_C14CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C14CR			MMIO32(DMAMUX1_BASE + 0x38)
/** DMAMUX1_DMAMUX1_C15CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX1_DMAMUX1_C15CR			MMIO32(DMAMUX1_BASE + 0x3c)
/** DMAMUX1_DMAMUX1_CSR DMAMUX request line multiplexer interrupt channel status register **/
#define DMAMUX1_DMAMUX1_CSR			MMIO32(DMAMUX1_BASE + 0x80)
/** DMAMUX1_DMAMUX1_CFR DMAMUX request line multiplexer interrupt clear flag register **/
#define DMAMUX1_DMAMUX1_CFR			MMIO32(DMAMUX1_BASE + 0x84)
/** DMAMUX1_DMAMUX1_RG0CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX1_DMAMUX1_RG0CR			MMIO32(DMAMUX1_BASE + 0x100)
/** DMAMUX1_DMAMUX1_RG1CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX1_DMAMUX1_RG1CR			MMIO32(DMAMUX1_BASE + 0x104)
/** DMAMUX1_DMAMUX1_RG2CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX1_DMAMUX1_RG2CR			MMIO32(DMAMUX1_BASE + 0x108)
/** DMAMUX1_DMAMUX1_RG3CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX1_DMAMUX1_RG3CR			MMIO32(DMAMUX1_BASE + 0x10c)
/** DMAMUX1_DMAMUX1_RG4CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX1_DMAMUX1_RG4CR			MMIO32(DMAMUX1_BASE + 0x110)
/** DMAMUX1_DMAMUX1_RG5CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX1_DMAMUX1_RG5CR			MMIO32(DMAMUX1_BASE + 0x114)
/** DMAMUX1_DMAMUX1_RG6CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX1_DMAMUX1_RG6CR			MMIO32(DMAMUX1_BASE + 0x118)
/** DMAMUX1_DMAMUX1_RG7CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX1_DMAMUX1_RG7CR			MMIO32(DMAMUX1_BASE + 0x11c)
/** DMAMUX1_DMAMUX1_RGSR DMAMux - DMA request generator status register **/
#define DMAMUX1_DMAMUX1_RGSR			MMIO32(DMAMUX1_BASE + 0x140)
/** DMAMUX1_DMAMUX1_RGCFR DMAMux - DMA request generator clear flag register **/
#define DMAMUX1_DMAMUX1_RGCFR			MMIO32(DMAMUX1_BASE + 0x144)

/**@}*/


/** @defgroup dmamux1_dmamux1_c0cr DMAMUX1C0CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_DMAMUX1_C0CR_SYNC_ID_SHIFT		24
#define DMAMUX1_DMAMUX1_C0CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c0cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C0CR_NBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_C0CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c0cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C0CR_SPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_C0CR_SPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_c0cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_C0CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_DMAMUX1_C0CR_SE		(1 << 16)
/** DMAMUX1_DMAMUX1_C0CR_EGE Event generation enable/disable **/
#define DMAMUX1_DMAMUX1_C0CR_EGE		(1 << 9)
/** DMAMUX1_DMAMUX1_C0CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_DMAMUX1_C0CR_SOIE		(1 << 8)

#define DMAMUX1_DMAMUX1_C0CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_C0CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_dmamux1_c0cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_c1cr DMAMUX1C1CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_DMAMUX1_C1CR_SYNC_ID_SHIFT		24
#define DMAMUX1_DMAMUX1_C1CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c1cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C1CR_NBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_C1CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c1cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C1CR_SPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_C1CR_SPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_c1cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_C1CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_DMAMUX1_C1CR_SE		(1 << 16)
/** DMAMUX1_DMAMUX1_C1CR_EGE Event generation enable/disable **/
#define DMAMUX1_DMAMUX1_C1CR_EGE		(1 << 9)
/** DMAMUX1_DMAMUX1_C1CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_DMAMUX1_C1CR_SOIE		(1 << 8)

#define DMAMUX1_DMAMUX1_C1CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_C1CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_dmamux1_c1cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_c2cr DMAMUX1C2CR DMAMux - DMA request line multiplexer channel x control register
@{*/


