grevaillot/svd_tools/headers/STM32H7x7_CM7/dmamux1.h
#define DMAMUX1_DMAMUX1_C11CR_SYNC_ID_SHIFT		24
#define DMAMUX1_DMAMUX1_C11CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c11cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C11CR_NBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_C11CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c11cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C11CR_SPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_C11CR_SPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_c11cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_C11CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_DMAMUX1_C11CR_SE		(1 << 16)
/** DMAMUX1_DMAMUX1_C11CR_EGE Event generation enable/disable **/
#define DMAMUX1_DMAMUX1_C11CR_EGE		(1 << 9)
/** DMAMUX1_DMAMUX1_C11CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_DMAMUX1_C11CR_SOIE		(1 << 8)

#define DMAMUX1_DMAMUX1_C11CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_C11CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_dmamux1_c11cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_c12cr DMAMUX1C12CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_DMAMUX1_C12CR_SYNC_ID_SHIFT		24
#define DMAMUX1_DMAMUX1_C12CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c12cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C12CR_NBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_C12CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c12cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C12CR_SPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_C12CR_SPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_c12cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_C12CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_DMAMUX1_C12CR_SE		(1 << 16)
/** DMAMUX1_DMAMUX1_C12CR_EGE Event generation enable/disable **/
#define DMAMUX1_DMAMUX1_C12CR_EGE		(1 << 9)
/** DMAMUX1_DMAMUX1_C12CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_DMAMUX1_C12CR_SOIE		(1 << 8)

#define DMAMUX1_DMAMUX1_C12CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_C12CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_dmamux1_c12cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_c13cr DMAMUX1C13CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_DMAMUX1_C13CR_SYNC_ID_SHIFT		24
#define DMAMUX1_DMAMUX1_C13CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c13cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C13CR_NBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_C13CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c13cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C13CR_SPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_C13CR_SPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_c13cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_C13CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_DMAMUX1_C13CR_SE		(1 << 16)
/** DMAMUX1_DMAMUX1_C13CR_EGE Event generation enable/disable **/
#define DMAMUX1_DMAMUX1_C13CR_EGE		(1 << 9)
/** DMAMUX1_DMAMUX1_C13CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_DMAMUX1_C13CR_SOIE		(1 << 8)

#define DMAMUX1_DMAMUX1_C13CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_C13CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_dmamux1_c13cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_c14cr DMAMUX1C14CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_DMAMUX1_C14CR_SYNC_ID_SHIFT		24
#define DMAMUX1_DMAMUX1_C14CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c14cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C14CR_NBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_C14CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c14cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C14CR_SPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_C14CR_SPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_c14cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_C14CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_DMAMUX1_C14CR_SE		(1 << 16)
/** DMAMUX1_DMAMUX1_C14CR_EGE Event generation enable/disable **/
#define DMAMUX1_DMAMUX1_C14CR_EGE		(1 << 9)
/** DMAMUX1_DMAMUX1_C14CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_DMAMUX1_C14CR_SOIE		(1 << 8)

#define DMAMUX1_DMAMUX1_C14CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_C14CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_dmamux1_c14cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_c15cr DMAMUX1C15CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX1_DMAMUX1_C15CR_SYNC_ID_SHIFT		24
#define DMAMUX1_DMAMUX1_C15CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c15cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_C15CR_NBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_C15CR_NBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_c15cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


