grevaillot/svd_tools/headers/STM32H7x7_CM7/dmamux1.h
#define DMAMUX1_DMAMUX1_C15CR_SPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_C15CR_SPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_c15cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_C15CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX1_DMAMUX1_C15CR_SE		(1 << 16)
/** DMAMUX1_DMAMUX1_C15CR_EGE Event generation enable/disable **/
#define DMAMUX1_DMAMUX1_C15CR_EGE		(1 << 9)
/** DMAMUX1_DMAMUX1_C15CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX1_DMAMUX1_C15CR_SOIE		(1 << 8)

#define DMAMUX1_DMAMUX1_C15CR_DMAREQ_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_C15CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux1_dmamux1_c15cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_csr DMAMUX1CSR DMAMUX request line multiplexer interrupt channel status register
@{*/


#define DMAMUX1_DMAMUX1_CSR_SOF_SHIFT		0
#define DMAMUX1_DMAMUX1_CSR_SOF_MASK		0xffff
/** @defgroup dmamux1_dmamux1_csr_sof SOF Synchronization overrun event flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_cfr DMAMUX1CFR DMAMUX request line multiplexer interrupt clear flag register
@{*/


#define DMAMUX1_DMAMUX1_CFR_CSOF_SHIFT		0
#define DMAMUX1_DMAMUX1_CFR_CSOF_MASK		0xffff
/** @defgroup dmamux1_dmamux1_cfr_csof CSOF Clear synchronization overrun event flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_rg0cr DMAMUX1RG0CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_DMAMUX1_RG0CR_GNBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_RG0CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_rg0cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_RG0CR_GPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_RG0CR_GPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_rg0cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_RG0CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_DMAMUX1_RG0CR_GE		(1 << 16)
/** DMAMUX1_DMAMUX1_RG0CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_DMAMUX1_RG0CR_OIE		(1 << 8)

#define DMAMUX1_DMAMUX1_RG0CR_SIG_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_RG0CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_rg0cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_rg1cr DMAMUX1RG1CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_DMAMUX1_RG1CR_GNBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_RG1CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_rg1cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_RG1CR_GPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_RG1CR_GPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_rg1cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_RG1CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_DMAMUX1_RG1CR_GE		(1 << 16)
/** DMAMUX1_DMAMUX1_RG1CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_DMAMUX1_RG1CR_OIE		(1 << 8)

#define DMAMUX1_DMAMUX1_RG1CR_SIG_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_RG1CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_rg1cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_rg2cr DMAMUX1RG2CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_DMAMUX1_RG2CR_GNBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_RG2CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_rg2cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_RG2CR_GPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_RG2CR_GPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_rg2cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_RG2CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_DMAMUX1_RG2CR_GE		(1 << 16)
/** DMAMUX1_DMAMUX1_RG2CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_DMAMUX1_RG2CR_OIE		(1 << 8)

#define DMAMUX1_DMAMUX1_RG2CR_SIG_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_RG2CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_rg2cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_rg3cr DMAMUX1RG3CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_DMAMUX1_RG3CR_GNBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_RG3CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_rg3cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX1_DMAMUX1_RG3CR_GPOL_SHIFT		17
#define DMAMUX1_DMAMUX1_RG3CR_GPOL_MASK		0x03
/** @defgroup dmamux1_dmamux1_rg3cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX1_DMAMUX1_RG3CR_GE DMA request generator channel enable/disable **/
#define DMAMUX1_DMAMUX1_RG3CR_GE		(1 << 16)
/** DMAMUX1_DMAMUX1_RG3CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX1_DMAMUX1_RG3CR_OIE		(1 << 8)

#define DMAMUX1_DMAMUX1_RG3CR_SIG_ID_SHIFT		0
#define DMAMUX1_DMAMUX1_RG3CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux1_dmamux1_rg3cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux1_dmamux1_rg4cr DMAMUX1RG4CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX1_DMAMUX1_RG4CR_GNBREQ_SHIFT		19
#define DMAMUX1_DMAMUX1_RG4CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux1_dmamux1_rg4cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


